using UnityEngine;

/// <summary>
/// ファミコン
/// </summary>
public class コンソールゲーム機 : MonoBehaviour
{
    //ファミコンにはカートリッジコネクターがある
    Iゲームソフト カートリッジコネクター;

    void Start()
    {
        ゲームソフトをカートリッジコネクターに接続する(new サンタクロース史上最大の作戦());
        //ゲームソフトをカートリッジコネクターに接続する(new 魔女狩り());
    }

    /// <summary>
    /// ゲームソフトを選択して、カートリッジコネクターに接続する
    /// </summary>
    /// <param name="ソフト"></param>
    void ゲームソフトをカートリッジコネクターに接続する(Iゲームソフト ゲームソフト)
    {
        カートリッジコネクター = ゲームソフト;
    }

    void Update()
    {
        if (Input.GetKeyDown(KeyCode.Space))
        {
            ゲーム機の電源を入れる();
        }
    }

    /// <summary>
    /// ゲーム機の電源を入れると、カートリッジコネクターに接続されているゲームソフトの内容がはじまる
    /// </summary>
    void ゲーム機の電源を入れる()
    {
        //カートリッジコネクターが接続されている場合、ゲーム内容がはじまる
        if (カートリッジコネクター != null)
        {
            カートリッジコネクター.GamePlay();
        }
    }
}
